# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo

# Parameters
nc: 24 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs
# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2 - Backbone P2 output (stride 4)
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4 - Backbone P3 output (stride 8)
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6 - Backbone P4 output (stride 16)
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8 - Backbone P5 output (stride 32)

# YOLO12-turbo head MODIFIED with P2 output
head:
  # --- P4/P5 path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9 (from P5=8)
  - [[-1, 6], 1, Concat, [1]] # 10 (cat backbone P4=6)
  - [-1, 2, A2C2f, [512, False, -1]] # 11 (Fused P4-1, for P3 path)

  # --- P3 path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12 (from Fused P4-1=11)
  - [[-1, 4], 1, Concat, [1]] # 13 (cat backbone P3=4)
  - [-1, 2, A2C2f, [256, False, -1]] # 14 (Fused P3 output) <- P3 detection input

  # --- P2 path (NEW) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15 (from Fused P3=14)
  - [[-1, 2], 1, Concat, [1]] # 16 (cat backbone P2=2)
  - [-1, 2, A2C2f, [256, False, -1]] # 17 (Fused P2 output) <- P2 detection input

  # --- Downsample path for P4 head ---
  - [14, 1, Conv, [256, 3, 2]] # 18 (Downsample Fused P3=14)
  - [[-1, 11], 1, Concat, [1]] # 19 (cat Fused P4-1=11)
  - [-1, 2, A2C2f, [512, False, -1]] # 20 (Fused P4-2 output) <- P4 detection input

  # --- Downsample path for P5 head ---
  - [20, 1, Conv, [512, 3, 2]] # 21 (Downsample Fused P4-2=20)  # Note: Source index changed from original
  - [[-1, 8], 1, Concat, [1]] # 22 (cat backbone P5=8)
  - [-1, 2, C3k2, [1024, True]] # 23 (Fused P5 output) <- P5 detection input

  # --- Detection Layer (P2, P3, P4, P5) ---
  - [[17, 14, 20, 23], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)